#+STARTUP: INDENT LOGDONE OVERVIEW NOLOGREFILE LATEXPREVIEW INLINEIMAGES
#+AUTHOR: kirakuiin
#+EMAIL: wang.zhuowei@foxmail.com
#+LANGUAGE: zh-Cn
#+TAGS: { Live : date(d) event(e) shopping(s) }
#+TAGS: { State : future(f) }
#+TODO: TODO(t) SCH(s) WAIT(w@) DOING(i) | DONE(d) CANCELED(c@)
#+COLUMNS: %25ITEM %TODO %17Effort(Estimated Effort){:} %CLOCKSUM
#+PROPERTY: EffORT_ALL 0 0:25 0:50 1:15 1:40 2:05 2:30 2:55 3:20
#+OPTIONS: tex:t


** TODO [#A] 每月报告及归档                                         :event:
DEADLINE: <2023-03-01 周三 23:00 ++1m> SCHEDULED: <2023-03-01 周三 09:00 ++1m>
:PROPERTIES:
:STYLE:    habit
:LOGGING: logrepeat DONE(@)
:LAST_REPEAT: [2023-02-02 周四 13:42]
:END:
- State "DONE"       from "TODO"       [2023-02-02 周四 13:42] \\
  工作上:
  1. 完成通行证界面优化
  2. 完成战斗速率调整
  3. 正式版屏蔽网络日志
  4. 修复内测服中出现的bug
  生活上:
  1. 过年过年
  2. 在家装了台台式机, 帮李琦也装了一台
  3. 过年搞完了灾厄和necesss
- State "DONE"       from "TODO"       [2023-01-10 周二 09:39] \\
  工作上:
  1. 完成主线战斗界面优化
  2. 完成战斗中埋点优化
  3. 完成真机上主菜单切换卡顿问题
  4. 完成状态面板调整工单
  5. 完成调查问卷工单
  6. 完成斗法场优化工单
  7. 处理真机后台断线问题
  8. 测试, 修复审核版问题
  9. 测试审核版在线更新流程
  生活上:
  1. 感染新冠休息两周, 症状为发烧三天, 然后扁桃体发炎5天, 伴随大量痰
  2. grounded, 七日杀结束, 开始terraria 灾厄和gtfo
  3. 准备购买回家车票
- State "DONE"       from "TODO"       [2022-12-02 周五 17:29] \\
  工作上:
  1. 战斗系统优化
     - 攻击者特效层级优化
     - 战斗中数据放到通用模块中方便调用
     - 战斗日志改为纯数据输出, 用于接入文字战报系统
     - 处理角色抖动问题(证实是蓝图的错误)
     - 处理胜利动画覆盖死亡动画问题
     - 处理跳字残留问题
     - 优化多场连续战斗生命值, 怒气的集成表现
     - 处理主线战斗跳转后无法开始战斗的bug
     - 处理镇魔卫道录像播放导致未能正确领取圣物的问题
  2. 公共
     - 接入维护公告
     - 接入火星登录系统
  3. 其他
     - server.ini增加服务器id配置
     - 处理在特定时机断开会导致无法登录的问题
  生活上:
  1. 减肥到140, 减不动了, 先这样吧, 维持定是跑步就好
  2. Catan项目在github中接入自动构建
- State "DONE"       from "TODO"       [2022-10-31 周一 11:02] \\
  工作上:
  1. 处理审核版测试出现的问题
  2. spine编辑器支持头顶位置
  3. 支持本地战斗录像
  4. 支持战斗协议回滚
  5. 支持巅峰竞技场战报
  生活上:
  1. 卡坦基本版开发完毕
- State "DONE"       from "TODO"       [2022-09-30 周五 19:31] \\
  工作上:
  - 接入公共系统
    1. 接入防沉迷系统
    2. 接入实名认证系统
    3. 完成接入战盟审核系统的功能
       - 支持战盟账号的注册, 登陆和切换
       - 修改部分战盟登陆的ui
       - 调整文本接口兼容公共模块
  - 项目优化
    1. 支持战斗场景切换
    2. 处理备战穿透
    3. 整理项目使用权限
    4. 处理json编码中文字符在ios上导致的错误
    5. 本地存储模块升级, 新增加密存储字段
       - 通过将数据结构转为json字符串然后在使用md5加密
       - 支持对元组的加密
    6. 支持网络协议录制功能
       - 通过gm指令来开关网络录制
       - 录制的录像以文件的形式存放于network_records目录下
    7. 支持录像播放器
       - 播放时可以按需过滤需要处理的网络协议
       - 支持对不同解包速率的模拟
    8. 支持战斗录像播放
       - 支持从网络协议录制导出的文件中播放战斗
       - 播放按钮位于测试战斗的左上角
  生活上:
  1. 废寝忘食的开发卡坦岛, 算是自己制作的第一款可以玩的游戏(并且还是多人联机)
- State "DONE"       from "TODO"       [2022-09-03 周六 19:21] \\
  工作上:
  1. spine角色附件功能拆分
  2. 技能描述新增附加效用
  3. spine编辑器优化
     - 支持默认数据修改
     - 新增底部信息组件
  4. ui编辑器优化
     - 兼容多边形框
     - 调整复选按钮的信号触发机制
     - 新增饼状图控件
  5. 战斗日志浏览器优化
     - 支持导入战斗指令执行数据
     - 支持数据图表和时间轴两种查看模式
  6. 战斗优化
     - 信息状态面板新增一键展开/缩放功能
     - 调整法宝技能喊招时机
     - 支持导出执行时间数据
     - 优化指令执行顺序, 支持跳过无效指令
     - 新增战场图腾显示功能
  7. gm调整
     - 新增屏蔽音效开关
  8. 构建相关
     - 编辑器打包改为加密包
  生活上:
  1. 平静的一个月
- State "DONE"       from "TODO"       [2022-07-28 周四 09:34] \\
  工作上:
  1. 成品号体验功能
  2. spine同个动作兼容多个动作名
  3. 特效层级优化
     - 生成虚拟节点来实现在角色上的位置
     - 支持计算受击中心的动态位置
  4. 受击特效优化
     - 为技能表现增加受击蓝图, 在受击时会播放受击蓝图
  5. 战斗特效缓存
     - 增加缓存模块, 处理战斗中反复创建的ui对象, 提高性能
  6. 优化spine编辑器
     - 重构spine编辑器, 优化界面, 支持灵活的的扩展
  生活上:
  1. death door, 很不错
  2. forager, 后期有点无聊了
  3. hades, 精致的画面, 拳拳到肉的打击感, 肉鸽中罕见的精美剧情
- State "DONE"       from "TODO"       [2022-07-04 周一 14:31] \\
  工作上:
  1. 编写季度报告
  2. 项目编辑器整合到一个通用入口处
  3. 项目编辑器统一使用固定位置的资源
  4. 战斗常量优化
  5. 实现特殊跳字(连击, 协战)
  6. 战斗信息面板优化
  7. 法术编辑器支持自动附加场景
  8. UI编辑器使用配置文件来达成生成时使用项目对象替换的功能
  9. 完成spine编辑器的总体设计和界面设计
  生活上:
  1. 无事发生
- State "DONE"       from "TODO"       [2022-05-30 周一 10:35] \\
  工作上:
  1. 完成战斗进度条
     - 通过对多个战斗协议的监听来实现角色释放技能时在上方同步显示进度动画的功能
     - 通过程序动画来表现进度条的移动
     - 通过头像覆盖图层来表示角色的死亡
  2. 优化站前表现
     - 部分战斗站前会发送大量的无效协议, 通过合并发送一次来降低战前的空白时间
  3. 拆分站位和场景
     - 将站位从场景中分里处理, 分为战前占位和战中占位
     - 将战前战中场景合并为一个场景
     - 通过挂载点在实现站位合理插入到场景的前景, 背景之中
  4. 跳字显示总伤害
     - 每次从服务器收到伤害数字协议, 根据伤害来源决定是否累计总伤害数字
     - 每个技能结束, 清理所有累计伤害数字
     - 采用ui动画+spine动画的形式来表现总伤害变化
  5. 优化英雄详情技能槽位
     - 技能槽位支持在特殊界面的特殊布局
     - 技能图标支持显示无法装配特性
  生活上:
  1. 这个痔疮, emmm, 真正让人体会到了什么叫做坐卧难安鸭
- State "DONE"       from "TODO"       [2022-05-09 周一 09:56] \\
  工作上:
  1. UI编辑器扩展
     1. 更加丰富的组件, 完善组价扩展接口
        - 点击吞噬控件
        - 点击提示控件
     2. UI控件优化
        - 复选按钮添加常用信号接口欧
        - 添加复用滚动框到编辑器中
        - 网格新增编辑器选项
  2. 处理游戏内部代码跳转失效问题
  3. 蓝图编辑器扩展
     1. 编辑器端新增简谐振动动作
     2. pubmagic新增简谐振动指令处理逻辑
  4. 编写初版行动条, 以客户端分析未来服务端指令作为主要实现方案
  生活上:
  1. 学吉他, 报了个吉他班
- State "DONE"       from "TODO"       [2022-04-01 周五 17:26] \\
  工作上:
  1. 编写季度报告
  2. 编写UI编辑器计划
  3. 战斗优化:
     - 第一回合前所有角色同时施法
     - 无敌盾物伤魔伤统一为伤害免疫
  4. 实现战斗中状态信息面板:
     - 实时显示状态, 属性, 法宝状态, 技能cd
  5. 完成UI编辑器自定义控件和组件研究
     - 新增新控件拖拽容器
     - 新增组件自动缩放
  6. 全部公共UI控件替换为项目控件
  7. 可点击对象接口优化
  8. 代码化过程中自动将容器子节点设置为元素
  生活上:
  1. 住房合同续租一年
  2. 法环法狐双开花
  3. 代码之外读完了
- State "DONE"       from "TODO"       [2022-02-28 周一 13:22] \\
  工作上:
  1. 学习了spine的基础概念
  2. 处理工单, 优化战斗退出, 战斗奖励和战斗结束拆分
  3. 处理工单, 开始战斗限制, 不上阵英雄无法开始战斗
  4. 实现战斗日志浏览器, 以一种更加方便的方式来浏览战斗导出的日志
  5. 处理工单, 优化状态显示, 新增状态面板来显示战斗中角色的具体状态
  生活上:
  1. 读完了穷爸爸, 富爸爸
:LOGBOOK:
CLOCK: [2022-03-01 周二 13:23]--[2022-03-01 周二 13:48] =>  0:25
CLOCK: [2022-03-01 周二 11:31]--[2022-03-01 周二 11:56] =>  0:25
CLOCK: [2022-03-01 周二 11:01]--[2022-03-01 周二 11:26] =>  0:25
CLOCK: [2022-03-01 周二 10:20]--[2022-03-01 周二 10:45] =>  0:25
CLOCK: [2022-03-01 周二 09:50]--[2022-03-01 周二 10:15] =>  0:25
CLOCK: [2022-02-28 周一 17:28]--[2022-02-28 周一 17:53] =>  0:25
CLOCK: [2022-02-28 周一 16:58]--[2022-02-28 周一 17:23] =>  0:25
CLOCK: [2022-02-28 周一 16:28]--[2022-02-28 周一 16:53] =>  0:25
CLOCK: [2022-02-28 周一 15:39]--[2022-02-28 周一 16:04] =>  0:25
CLOCK: [2022-02-28 周一 15:04]--[2022-02-28 周一 15:29] =>  0:25
CLOCK: [2022-02-28 周一 14:34]--[2022-02-28 周一 14:59] =>  0:25
CLOCK: [2022-02-28 周一 14:04]--[2022-02-28 周一 14:29] =>  0:25
CLOCK: [2022-02-28 周一 13:20]--[2022-02-28 周一 13:45] =>  0:25
:END:
- State "DONE"       from "TODO"       [2022-01-27 周四 16:46] \\
  工作上:
  1. 研究2D摄像机使用方式并输出摄像机组件
  2. 本地存储采用localsave
  3. 支持战士释放技能结束后如果不在原位自动返回原位
  4. 行动触发顺序改版, 由一次性触发改为分层次触发
  5. 优化代码里的magic key
  6. prompt提示信息配置导表
  7. 优化战斗日志输出, 改为json形式
  8. 死亡和受伤表现优化, 死亡会停止所有行为并在原地死亡, 受伤只会在闲置或受伤状态下
     丢失生命时触发
  9. 支持任意战斗阵容导出(仅支持配置, 角色数值目前无法导出)
  10. 处理若干导致战斗卡死的问题
  生活上:
  1. 学习代码之外
  2. 弹射把血压拉满了, 差点被气死
- State "DONE"       from "TODO"       [2021-12-30 周四 20:25] \\
  工作上:
  1. 优化第三版战斗表现, 死亡时不会播放行为
  2. 处理备战界面属性不会刷新的问题
  3. 新增根据光环显示不同效果的光环控件, 并加入到编辑器进行编辑
  4. 新增几个ui映射来处理不同道具使用不同底图, 边框
  5. 将英雄山装备稀有度修改为道具品质
  6. 新增拖拽控件, 用来管理容器内节点, 使其可以任意方向拖拽
  7. 实现战斗中播放法宝激活效果
  8. 编写年报
  9. 实现第四版战斗解析
  10. 第四版战斗优化, 优化效果播放顺序, 新增嵌套行为播放逻辑
  11. 将受击表现从蓝图击中信号触发分离, 改为由受击指令触发
  12. 新增部分受击蓝图和受击表现
  13. 迁移负责模块的常量到对应的netdefine文件中
  生活上:
  1. 阅读完 <解读基金, 我的投资观与实践>
  2. 弹射世界还不错哦, 挺好玩的
- State "DONE"       from "TODO"       [2021-11-30 周二 20:55] \\
  工作上:
  1. 实现了一套新的战斗解析器和战斗打包，通过每个行为的前摇后摇来控制播放顺序
  2. 解决了嵌套行为解析问题
  3. 接入了怒气系统表现
  4. 编写战斗系统文档
  生活上:
  1. 读完小狗钱钱
- State "DONE"       from "TODO"       [2021-11-01 周一 11:30] \\
  工作上:
  1. 完成了《我所理解的cocos2dx》的学习
  2. 删除了旧战斗模块的代码
  3. 战斗及战斗指令, 战斗表现优化
  4. 为测试战斗添加了战斗记录导入导出功能
  5. 实现输出可读的服务器战斗协议记录的功能
  6. 实现了测试战斗的战斗进度控制组件
  7. 完成了年度总结和年度面谈
  生活上:
  1. 车胎的外胎和碟刹全换换
  2. 领取公司枪火激活码两个, 美滋滋
  3. 第三次西域胡杨, 吐了吐了
  4. 玩到了目前玩过的最好玩的卡牌解密游戏, 邪恶铭刻, 强烈推荐
- State "DONE"       from "TODO"       [2021-09-30 周四 17:40] \\
  工作上:
  1. 优化游戏启动流程
  2. 规范模块重启代码
  3. 完善m8delegate
  4. 编写季度报告
  5. 处理补丁未能同步外链问题
  6. 分享pub代码
  7. 迁移多队战斗代码
  生活上:
  1. 理发
  2. 老妈来这里过国庆了
  3. 9.28半斤请客聚餐, 泪目
- State "DONE"       from "TODO"       [2021-08-30 周一 20:50] \\
  第五个月, 工作上:
  1. 完成了基础商店功能的制作
  2. 完成了新版英雄山英雄背包的制作
  3. 完成了在新版英雄山英雄背包中给队友穿戴装备的功能
  4. 完成了英雄分解功能的制作
  5. 优化了英雄删除流程
  6. 完成了临时处理： 根据战斗力得出英雄山战斗结果, 跳过战斗过程
  7. 完成了对补丁制作流程的学习, 并应用到项目之中
  8. 完成了代码整洁之道的学习
  生活上:
  1. 原疯了
  2. 熟悉的补丁工作, 熟悉的脑溢血
- State "DONE"       from "TODO"       [2021-07-31 周六 19:44] \\
  第四个月, 工作上:
  1. 完成了《改善python程序的91个建议》的学习
  2. 优化网络协议使用方式和输出
  3. 学习了5个UI控件的使用方式
  4. 完成了英雄山关卡坐标和关卡分组标分配功能
  5. 完成了对UI编辑器工作流程和属性学习
  6. 完成了英雄升星工单
  7. 完成了组队信息同步工单
  生活上:
  1. 日常生活非常的平静
  2. 简易对我进我一个教育, 希望能够主动承担更多的责任, 工作更努力, 学习更勤奋
- State "DONE"       from "TODO"       [2021-06-30 周三 22:59] \\
  入职以后的第三个月, 完成了转正, 工作上主要完成了:
  1. 完成了临时组队功能
  2. 完成了三队战斗功能(单人模式, 英雄山模式)
  3. 完成了战斗模型的解耦重构
  4. 完成了季度报告和转正报告
  5. 完成了游戏编程模式的学习, 开始学习python的91个建议
  生活上:
  1. 办理电信宽带
  2. 购买电脑配件并装机
- State "DONE"       from "TODO"       [2021-05-30 Sun 09:26] \\
  入职之后的第二个月, 正式开始进入工作, 工作上主要完成:
  1. 完成了m8英雄山基本功能的设计与实现(mvc)
  2. 完成了m8临时组队功能的设置与实现(mvc)
  3. 完成了大量m8界面优化相关的工单
  4. 完成了ios和android平台真机包的制作
  生活上：
  1. 接种了两针新冠疫苗
  2. 家里的东西, 办公用品基本置办齐全
- State "DONE"       from "TODO"       [2021-04-30 周五 23:01] \\
  入职之后的第一个月, 生活和工作逐渐回到了正轨, 主要完成了以下几个主要事情:
  1. 学会了使用org-mode进行gtd管理
  2. 完成了多益的入职培训
  3. 找到了一处还不错的房子
  4. 认识了很多很棒的同事
** TODO [#A] 每周学习晨星网投资教程一篇 [1/1]                       :event:
DEADLINE: <2022-06-19 周日 23:59 ++1w> SCHEDULED: <2022-06-20 周一 09:00 ++1w>
:PROPERTIES:
:STYLE:    habit
:LOGGING: logrepeat DONE(@)
:LAST_REPEAT: [2022-05-11 周三 15:07]
:END:
- State "DONE"       from "TODO"       [2022-05-11 周三 15:07]
- State "DONE"       from "TODO"       [2022-04-18 周一 12:10]
- State "DONE"       from "TODO"       [2022-04-12 周二 20:41]
- State "DONE"       from "TODO"       [2022-04-02 周六 20:49]
- State "DONE"       from "TODO"       [2022-03-28 周一 11:40]
- State "DONE"       from "TODO"       [2022-03-21 周一 10:50]
- State "DONE"       from "TODO"       [2022-03-14 周一 10:39]
- State "DONE"       from "TODO"       [2022-03-07 周一 15:39]
:LOGBOOK:
CLOCK: [2022-03-28 周一 11:15]--[2022-03-28 周一 11:40] =>  0:25
CLOCK: [2022-03-07 周一 15:27]--[2022-03-07 周一 15:39] =>  0:12
CLOCK: [2022-03-07 周一 14:57]--[2022-03-07 周一 15:22] =>  0:25
CLOCK: [2022-03-07 周一 14:27]--[2022-03-07 周一 14:52] =>  0:25
:END:
- State "DONE"       from "TODO"       [2022-03-06 周日 23:20]
- State "DONE"       from "TODO"       [2022-02-28 周一 09:20]
- [X] 第一篇
